Update diagram in README.md to mermaid
